// Даны два массива: ['a', 'b', 'c'] и [1, 2, 3]. Объедините их вместе.

// let arr = ['a', 'b', 'c',];
// let arr2 = [,1, 2, 3,];

// console.log(arr+arr2);




// Дан массив ['a', 'b', 'c']. Добавьте ему в конец элементы 1, 2, 3.

// const arr = ['a', 'b', 'c',];
// arr.push(1,2,3,)

// console.log(arr);




// Дан массив [1, 2, 3]. Сделайте из него массив [3, 2, 1].

// const arr = [1, 2, 3,];
// arr[0] = 3;
// arr[1] = 2;
// arr[2] = 1;

// console.log(arr);





// Дан массив [1, 2, 3]. Сделайте из него массив [3, 2, 1].

// const arr =[1, 2, 3];
// arr.splice(0,3,3,2,1)

// console.log(arr);







//  Дан массив [1, 2, 3]. Добавьте ему в начало элементы 4, 5, 6.

//  const arr = [1, 2, 3];
//  arr.unshift(4,5,6);

//  console.log(arr);





                                  //РАБОТА С SHIFT, POP.




//   Дан массив ['js', 'css', 'jq']. Выведите на экран первый элемент.

// const arr = ['js', 'css', 'jq']
// arr.pop();
// arr.pop();

// console.log(arr);










// Дан массив ['js', 'css', 'jq']. Выведите на экран последний элемент.

// const arr = ['js', 'css', 'jq'];

// arr.shift()
// arr.shift()

// console.log(arr);










                                      //РАБОТА С SLICE

// Дан массив [1, 2, 3, 4, 5]. С помощью метода slice запишите в новый элементы [1, 2, 3].

// const arr = [1, 2, 3, 4, 5];
// let arr2 = arr.slice(0,3);

// console.log(arr2);











// Дан массив [1, 2, 3, 4, 5]. С помощью метода slice запишите в новый элементы [4, 5].

// const arr = [1, 2, 3, 4, 5];
// let arr2 = arr.slice(3,5);

// console.log(arr2);









                                            //РАБОТА С SPLICE

//Дан массив [1, 2, 3, 4, 5]. С помощью метода splice преобразуйте массив в [1, 4, 5].

// const arr = [1, 2, 3, 4, 5];
// arr.splice (1,2);

// console.log(arr);













//Дан массив [1, 2, 3, 4, 5]. С помощью метода splice запишите в новый массив элементы [2, 3, 4].

// const arr = [1, 2, 3, 4, 5];
// arr.splice (0,5,2,3,4);

// console.log(arr);













//Дан массив [1, 2, 3, 4, 5]. С помощью метода splice сделайте из него массив [1, 2, 3, 'a', 'b', 'c', 4, 5].

// const arr = [1, 2, 3, 4, 5];
// arr.splice(3,2,'a','b','c', 4, 5);

// console.log(arr);











//Дан массив [1, 2, 3, 4, 5]. С помощью метода splice сделайте из него массив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].

// const arr = [1, 2, 3, 4, 5];
// arr.splice(1,4,'a', 'b', 2, 3, 4, 'c', 5, 'e');

// console.log(arr);





